<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current version of GanttProject and builds a package.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.GanttProject</string>
    <key>Input</key>
    <dict>
          <key>NAME</key>
          <string>GanttProject</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.ganttproject</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
              <key>Processor</key>
              <string>PkgRootCreator</string>
              <key>Arguments</key>
              <dict>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                  <key>pkgdirs</key>
                  <dict>
                        <key>Applications</key>
                        <string>0775</string>
                  </dict>
              </dict>
        </dict>
        <dict>
              <key>Processor</key>
              <string>Copier</string>
              <key>Arguments</key>
              <dict>
                    <key>source_path</key>
                    <string>%target%/GanttProject.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/GanttProject.app</string>
              </dict>
        </dict>
        <dict>
              <key>Processor</key>
              <string>PkgCreator</string>
              <key>Arguments</key>
              <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkg_request</key>
                    <dict>
                          <key>pkgdir</key>
                          <string>%RECIPE_CACHE_DIR%</string>
                          <key>id</key>
                          <string>net.sourceforge.ganttproject.pkg</string>
                          <key>options</key>
                          <string>purge_ds_store</string>
                          <key>chown</key>
                          <array>
                                  <dict>
                                          <key>path</key>
                                          <string>Applications</string>
                                          <key>user</key>
                                          <string>root</string>
                                          <key>group</key>
                                          <string>admin</string>
                                  </dict>
                          </array>
                    </dict>
              </dict>
        </dict>
    </array>
</dict>
</plist>
