<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of GanttProject</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.ganttproject</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GanttProject</string>
        <key>BASE_URL</key>
        <string>https://www.ganttproject.biz</string>
        <key>SEARCH_URL</key>
        <string>%BASE_URL%/download/free</string>
        <key>SEARCH_URL_COOKIE</key>
        <string>download-visited=y</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;/dl/(?P&lt;version&gt;.*?)/mac)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_4) AppleWebKit/600.7.12 (KHTML, like Gecko) Version/8.0.7 Safari/600.7.12</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
        <key>Arguments</key>
        <dict>
          <key>SOURCEFORGE_PROJECT_NAME</key>
          <string>ganttproject</string>
          <key>SOURCEFORGE_FILE_PATTERN</key>
          <string>ganttproject-\d+.\d+.\d+-r\d+\.dmg</string>
        </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
            <key>filename</key>
            <string>GanttProject.dmg</string>
          </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileMover</string>
        <key>Arguments</key>
        <dict>
          <key>source</key>
          <string>%pathname%</string>
          <key>target</key>
          <string>%RECIPE_CACHE_DIR%/downloads/GanttProject-%version%.dmg</string>
        </dict>
      </dict>
    </array>
</dict>
</plist>
