<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>Description</key>
      <string>Downloads the current release of GanttProject and imports into Munki.</string>
      <key>Identifier</key>
      <string>uk.ac.ox.orchard.munki.GanttProject</string>
      <key>Input</key>
      <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>GanttProject</string>
            <key>NAME</key>
            <string>GanttProject</string>
            <key>pkginfo</key>
            <dict>
                  <key>catalogs</key>
                  <array>
                          <string>unstable</string>
                  </array>
		  <key>category</key>
		  <string>Office and Productivity</string>
                  <key>description</key>
                  <string>Free project scheduling and management app for Windows, OSX and Linux.</string>
                  <key>display_name</key>
                  <string>GanttProject</string>
                  <key>name</key>
                  <string>%NAME%</string>
                  <key>unattended_install</key>
                  <true/>
            </dict>
      </dict>
      <key>MinimumVersion</key>
      <string>0.2.0</string>
      <key>ParentRecipe</key>
      <string>uk.ac.ox.orchard.download.ganttproject</string>
      <key>Process</key>
      <array>
            <dict>
                  <key>Arguments</key>
                  <dict>
                        <key>pkg_path</key>
                        <string>%pathname%</string>
                        <key>repo_subdirectory</key>
                        <string>%MUNKI_REPO_SUBDIR%</string>
                  </dict>
                  <key>Processor</key>
                  <string>MunkiImporter</string>
            </dict>
      </array>
</dict>
</plist>
