<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2022</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of SWI Prolog and imports into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.SWIProlog</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SWI_Prolog</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME%</string>
    <key>DISPLAY_NAME</key>
    <string>SWI Prolog</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>developer</key>
      <string>swi-prolog.org</string>
      <key>display_name</key>
      <string>%DISPLAY_NAME%</string>
      <key>category</key>
      <string>Software Development</string>
      <key>description</key>
      <string>SWI-Prolog is a versatile implementation of Prolog, a logic programming language associated with artificial intelligence and computational linguistics.</string>
      <key>postinstall_script</key>
      <string>#!/bin/sh
ln -sf /Applications/SWI-Prolog.app/Contents/MacOS/swipl /Applications/SWI-Prolog.app/Contents/MacOS/swipl-ld /usr/local/bin
      </string>
      <key>postuninstall_script</key>
      <string>#!/bin/sh
[ -h /usr/local/bin/swipl ] &amp;&amp; [ ! -f /usr/local/bin/swipl ] &amp;&amp; rm -f /usr/local/bin/swipl /usr/local/bin/swipl-ld
      </string>
    </dict>
  </dict>
  <key>ParentRecipe</key>
  <string>uk.ac.ox.orchard.download.SWIProlog</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
