<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2020</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>imc at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of TypeScript</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.TypeScript</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>TypeScript</string>
    <key>name</key>
    <string>typescript</string>
    <key>RELEASE</key>
    <string>latest</string>
    <key>BASE_URL</key>
    <string>https://registry.npmjs.org/%name%</string>
    <key>SEARCH_PATTERN</key>
    <string>"%RELEASE%":"(?P&lt;version&gt;[^"]+)".*?"(?P=version)":\{.*?"tarball":"(?P&lt;pkgurl&gt;[^"]+)"</string>
  </dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>re_flags</key>
        <array>
          <string>DOTALL</string>
        </array>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%pkgurl%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
