<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2020</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ian Collier</string>
        <key>Email</key>
        <string>ian.collier at cs.ox.ac.uk</string>
        <key>Github</key>
        <string>imc0</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Packages the latest version of TypeScript</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.TypeScript</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>TypeScript</string>
      <key>name</key>
      <string>typescript</string>
      <key>PKGID</key>
      <string>uk.ac.ox.orchard.pkg.%name%</string>
      <key>MODULE_DIR_REL</key>
      <string>lib/node_modules/%name%</string>
      <key>MODULE_DIR</key>
      <string>usr/local/%MODULE_DIR_REL%</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.TypeScript</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <!-- explicitly create all directories that are not in the tarball
                 so that they have the correct permissions.  Apparently this
                 processor doesn't accept variable substitution (because the
                 directory names are keys, not strings), so these names have
                 to match the directory names that are in the input section. -->
            <key>usr</key>
            <string>0755</string>
            <key>usr/local</key>
            <string>0755</string>
            <key>usr/local/bin</key>
            <string>0755</string>
            <key>usr/local/lib</key>
            <string>0755</string>
            <key>usr/local/lib/node_modules</key>
            <string>0755</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <!-- Note: the tarball does not contain directories, so this has to
             be done with a sensible umask (022 or at a pinch 002) because
             it is basically impossible to fix the directory permissions
             without altering all the plain files. -->
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <!-- By using FileMover instead of Copier we preserve the permissions -->
        <string>FileMover</string>
        <key>Arguments</key>
        <dict>
          <key>source</key>
          <string>%RECIPE_CACHE_DIR%/unpack/package</string>
          <key>target</key>
          <string>%pkgroot%/%MODULE_DIR%</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Symlinker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/tsc</string>
          <key>source_path</key>
          <string>../%MODULE_DIR_REL%/bin/tsc</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Symlinker</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%pkgroot%/usr/local/bin/tsserver</string>
          <key>source_path</key>
          <string>../%MODULE_DIR_REL%/bin/tsserver</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>id</key>
            <string>%PKGID%</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <!-- all files will be owned by root:admin -->
              <dict>
                <key>path</key>
                <string>usr</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <!-- Symlinker doesn't set the mode, so do it explicitly
                   for files in /usr/local/bin -->
              <dict>
                <key>path</key>
                <string>usr/local/bin</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
                <key>mode</key>
                <string>755</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict> 
</plist>
