<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Rogue Amoeba Soundflower.</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Soundflower</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Soundflower</string>
    <key>DOWNLOAD_URL</key>
    <string>https://rogueamoeba.com/freebies/soundflower/download.php</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.2</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
        <key>request_headers</key>
        <dict>
          <key>user-agent</key>
          <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_4) AppleWebKit/600.7.12 (KHTML, like Gecko) Version/8.0.7 Safari/600.7.12</string>
        </dict>
        <key>filename</key>
        <string>%NAME%.zip</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
  </array>
</dict>
</plist>
