<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2015</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Download's the latest version of University of Kent's BlueJ and imports into Munki</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.BlueJ</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>BlueJ</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Software Development</string>
        <key>description</key>
        <string>A free Java Development Environment designed for beginners, used by millions worldwide.</string>
        <key>developer</key>
        <string>University of Kent</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.BlueJ</string>
    <key>Process</key>
    <array>
      <dict>
       <key>Arguments</key>
       <dict>
         <key>pkg_path</key>
         <string>%pathname%</string>
         <key>repo_subdirectory</key>
         <string>%MUNKI_REPO_SUBDIR%</string>
       </dict>
       <key>Processor</key>
       <string>MunkiImporter</string>        
      </dict>
    </array>
  </dict>
</plist>
