<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ben Goodstein</string>
      <key>Email</key>
      <string>ben.goodstein@it.ox.ac.uk</string>
      <key>Github</key>
      <string>fuzzylogiq</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of University of Kent's BlueJ</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.BlueJ</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>BlueJ</string>
    <key>BASE_URL</key>
    <string>http://bluej.org</string>
    <key>SEARCH_PATTERN</key>
    <string>download/files/BlueJ-\d+\.zip</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>Version (?P&lt;version&gt;.*),</string>
      </dict>
    </dict>
     <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
   <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%/%match%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>
