<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2015</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.oXygenXMLEditor</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>Oxygen_XML_Editor</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Software Development</string>
        <key>description</key>
        <string>The Oxygen XML Editor is a multi-platform XML editor, XSLT/XQuery debugger and profiler with Unicode support.</string>
        <key>developer</key>
        <string>SyncRO Soft SRL</string>
        <key>display_name</key>
        <string>Oxygen XML Editor</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.oXygenXMLEditor</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
