<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2015</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.oXygenXMLEditor</string>
    <key>Input</key>
    <dict>
      <key>DERIVE_MIN_OS</key>
      <string>YES</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>Oxygen_XML_Editor</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Software Development</string>
        <key>description</key>
        <string>The Oxygen XML Editor is a multi-platform XML editor, XSLT/XQuery debugger and profiler with Unicode support.</string>
        <key>developer</key>
        <string>SyncRO Soft SRL</string>
        <key>display_name</key>
        <string>Oxygen XML Editor</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>preinstall_script</key>
        <string>#!/bin/sh
# New versions of oXygen should not be installed over old versions, so remove
# the old version first
if pkgutil --files %PKGID% 2>/dev/null | grep -q Applications/Oxygen/
then
    rm -rf /Applications/Oxygen
    pkgutil --forget %PKGID%
fi
exit 0
        </string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.oXygenXMLEditor</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
            <key>faux_root</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>installs_item_paths</key>
            <array>
                <string>/Applications/Oxygen/Oxygen XML Editor.app</string>
            </array>
            <key>derive_minimum_os_version</key>
            <string>%DERIVE_MIN_OS%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
