<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ben Goodstein</string>
      <key>Email</key>
      <string>ben.goodstein at it.ox.ac.uk</string>
      <key>Github</key>
      <string>fuzzylogiq</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of oXygen XML Editor</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.oXygenXMLEditor</string>
  <key>Input</key>
  <dict>
    <key>SITE</key>
    <string>https://www.oxygenxml.com</string>
    <key>DOWNLOAD_PAGE</key>
    <string>https://www.oxygenxml.com/xml_editor/download_oxygenxml_editor.html</string>
    <key>NAME</key>
    <string>Oxygen_XML_Editor</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_PAGE%</string>
        <key>request_headers</key>
	<dict>
		<key>user-agent</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36</string>
	</dict>
	<key>re_pattern</key>
        <string>macOS universal.*?Version:.*?&gt;(?P&lt;version&gt;[\d\.]+).*?url=https?://[^/]+(?P&lt;urlpath&gt;[^&quot;']+?oxygen-openjdk\.dmg)</string>
        <key>re_flags</key>
            <array>
              <string>IGNORECASE</string>
              <string>DOTALL</string>
            </array>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://mirror.oxygenxml.com%urlpath%</string>
        <key>filename</key>
        <string>%NAME%-%version%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>
