<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Copyright</key>
    <string>(c) University of Oxford 2015 - Ben Goodstein (fuzzylogiq on github)</string>
    <key>Description</key>
    <string>Downloads a version of Erlang and imports it into Munki.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.Erlang</string>
    <key>Input</key>
    <dict>
      <key>DISPLAY_NAME</key>
      <string>%NAME%</string>
      <key>MUNKI_CATEGORY</key>
      <string>Software Development</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>Erlang</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>%MUNKI_CATEGORY%</string>
        <key>description</key>
        <string>Erlang is a programming language used to build massively scalable soft real-time systems with requirements on high availability.</string>
        <key>Developer</key>
        <string>Ericsson OTP</string>
        <key>display_name</key>
        <string>%DISPLAY_NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.Erlang</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
