<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2015</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Gary Ballantine</string>
        <key>Email</key>
        <string>gary.ballantine at it.ox.ac.uk</string>
        <key>Github</key>
        <string>AltMeta</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Download the current version of Eyefi Mobi Desktop and extracts the version info from the package</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.EyefiMobiDesktop</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Eyefi_Mobi_Desktop</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.EyefiMobiDesktop</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
	<string>FlatPkgUnpacker</string>
	<key>Arguments</key>
	<dict>
	  <key>purge_destination</key>
	  <true/>
	  <key>destination_path</key>
	  <string>%RECIPE_CACHE_DIR%/extract</string>
	  <key>flat_pkg_path</key>
	  <string>%pathname%</string>
	</dict>
      </dict>
      <dict>
        <key>Processor</key>
	<string>PkgPayloadUnpacker</string>
	<key>Arguments</key>
	<dict>
          <key>purge_destination</key>
	  <true/>
	  <key>destination_path</key>
	  <string>%RECIPE_CACHE_DIR%/payload</string>
	  <key>pkg_payload_path</key>
	  <string>%RECIPE_CACHE_DIR%/extract/com.eyefi.Mobi.pkg/Payload</string>
	</dict>
      </dict>
      <dict>
	<key>Processor</key>
	<string>Versioner</string>
	<key>Arguments</key>
	<dict>
	  <key>input_plist_path</key>
	  <string>%RECIPE_CACHE_DIR%/payload/Eyefi Mobi.app/Contents/Info.plist</string>
	</dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>FileMover</string>
	<key>Arguments</key>
	<dict>
	  <key>source</key>
	  <string>%pathname%</string>
	  <key>target</key>
	  <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.pkg</string>
	</dict>
      </dict> 
    </array>
  </dict>
</plist>
