<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of EditShare Lightworks</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.lightworks</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lightworks</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
<<<<<<< HEAD
                <key>url</key>
		<string>https://app.lwks.com/api/auth/download/lightworks/mac_osx</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
=======
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://25893642.fs1.hubspotusercontent-eu1.net/hubfs/25893642/Lightworks%20Latest%20Version/lightworks_mac.dmg</string>
>>>>>>> c56d7981398280875a5b2d35980b5cc09690b678
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Lightworks.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.LWKS.lightworks" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7SP64L7NC9")</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
              <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Lightworks.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
		<string>CFBundleShortVersionString</string>
              </dict>
        </dict>
    </array>
</dict>
</plist>
