<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of EditShare Lightworks</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.lightworks</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lightworks</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string><![CDATA[https://www.lwks.com/index.php?option=com_lwks&view=download&Itemid=206]]></string>
               <key>re_pattern</key>
               <string><![CDATA[Lightworks for Mac OS X</h.*<strong>Latest release:</strong>.*<strong>(.*)</strong>.*<span>Release date:</span>]]></string>
               <key>result_output_var_name</key>
               <string>version</string>
               <key>re_flags</key>
               <array>
                   <string>MULTILINE</string>
                   <string>DOTALL</string>
               </array>
	    </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string><![CDATA[https://www.lwks.com/index.php?option=com_docman&task=doc_download&gid=210]]></string>
            	<key>filename</key>
            	<string>lightworks-download-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
