<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
         <key>Name</key>
	 <string>Ian Collier</string>
	 <key>Email</key>
	 <string>imc at cs.ox.ac.uk</string>
	 <key>Github</key>
	 <string>imc0</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Import the latest version of Foreman into Munki</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.HerokuToolbelt</string>
    <key>Input</key>
    <dict>
      <key>DISPLAY_NAME</key>
      <string>Foreman</string>
      <key>NAME</key>
      <string>Foreman</string>
      <key>MUNKI_CATEGORY</key>
      <string>Software Development</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
	<array>
	  <string>testing</string>
	</array>
        <key>category</key>
        <string>%MUNKI_CATEGORY%</string>
        <key>description</key>
        <string>Foreman is a manager for applications that consist of a number of background workers. The various processes that are needed to run your application are declared using a Procfile; Foreman will take care of starting them correctly and will display their output.</string>
        <key>developer</key>
        <string>David Dollar</string>
        <key>display_name</key>
        <string>%DISPLAY_NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.Foreman</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict> 
</plist>
