<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>Description</key>
      <string>Download the current version of Mou and builds a package.</string>
      <key>Identifier</key>
      <string>uk.ac.ox.orchard.pkg.mou</string>
      <key>Input</key>
      <dict>
            <key>NAME</key>
            <string>Mou</string>
      </dict>
      <key>ParentRecipe</key>
      <string>uk.ac.ox.orchard.download.mou</string>
      <key>Process</key>
      <array>
      <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
      </dict>
      <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                  <key>archive_path</key>
                  <string>%pathname%</string>
                  <key>destination_path</key>
                  <string>%pkgroot%/Applications</string>
                  <key>purge_destination</key>
                  <true/>
            </dict>
      </dict>
      <dict>
            <key>Comment</key>
            <string>Get version from the app</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                  <key>input_plist_path</key>
                  <string>%pkgroot%/Applications/Mou.app/Contents/Info.plist</string>
                  <key>plist_version_key</key>
                  <string>CFBundleShortVersionString</string>
            </dict>
      </dict>
      <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                  <key>pkg_request</key>
                  <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>id</key>
                        <string>ch.sudo.Mou</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                        <dict>
                              <key>path</key>
                              <string>Applications</string>
                              <key>user</key>
                              <string>root</string>
                              <key>group</key>
                              <string>admin</string>
                        </dict>
                        </array>
                  </dict>
            </dict>
      </dict>
      </array>
</dict>
</plist>
