<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current version of Mou</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.mou</string>
    <key>Input</key>
    <dict>
          <key>NAME</key>
          <string>Mou</string>
          <key>BASE_URL</key>
          <string>http://25.io</string>
          <key>SEARCH_URL</key>
          <string>%BASE_URL%/mou</string>
          <key>SEARCH_PATTERN</key>
          <!-- (?P<pkgurl>download\/Mou.zip) -->
          <string>(?P&lt;pkgurl&gt;download\/Mou.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
    <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
          </dict>
    </dict>
    <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%SEARCH_URL%/%pkgurl%</string>
          </dict>
    </dict>
    <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
    </dict>
    </array>
</dict>
</plist>

