<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>Description</key>
      <string>Download the current release of Mou and imports into Munki.</string>
      <key>Identifier</key>
      <string>uk.ac.ox.orchard.munki.mou</string>
      <key>Input</key>
      <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Mou</string>
            <key>NAME</key>
            <string>Mou</string>
            <key>pkginfo</key>
            <dict>
                  <key>catalogs</key>
                  <array>
                          <string>testing</string>
                  </array>
                  <key>category</key>
                  <string>Office and Productivity</string>
                  <key>description</key>
                  <string>Markdown editor for developers</string>
                  <key>display_name</key>
                  <string>Mou</string>
                  <key>name</key>
                  <string>%NAME%</string>
                  <key>unattended_install</key>
                  <true/>
            </dict>
      </dict>
      <key>ParentRecipe</key>
      <string>uk.ac.ox.orchard.pkg.mou</string>
      <key>Process</key>
      <array>
      <dict>
            <key>Arguments</key>
            <dict>
                  <key>pkg_path</key>
                  <string>%pkg_path%</string>
                  <key>repo_subdirectory</key>
                  <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
      </dict>
      </array>
</dict>
</plist>
