<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Eclipse Mars and imports into Munki.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.EclipseMars</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>Eclipse Mars</string>
        <key>NAME</key>
        <string>Eclipse_Mars</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Tools for Java developers creating Java EE and Web applications, including a Java IDE, tools for Java EE, JPA, JSF, Mylyn, EGit and others.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Eclipse.org</string>
            <key>category</key>
            <string>Software Development</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.EclipseMars</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
