<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ian Collier</string>
        <key>Email</key>
        <string>ian.collier at cs.ox.ac.uk</string>
        <key>Github</key>
        <string>imc0</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Packages the latest version of Gradle</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.Gradle</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Gradle</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.Gradle</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <key>usr</key>
            <string>0775</string>
            <key>usr/local</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/payload/usr/local</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>id</key>
            <string>uk.ac.ox.orchard.pkg.Gradle</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>usr/local</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict> 
</plist>
