<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2016</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Gradle</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Gradle</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Gradle</string>
    <key>BASE_URL</key>
    <string>https://gradle.org/gradle-download/</string>
    <key>SEARCH_PATTERN</key>
    <string>"([^"]+-(?P&lt;version&gt;[0-9.]+)-all.zip)"&gt;</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%match%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
