<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2019</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Gluon Scene Builder</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.SceneBuilder</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SceneBuilder</string>
    <key>BASE_URL</key>
    <string>https://gluonhq.com/products/scene-builder/</string>
    <key>DOWNLOAD_URL</key>
    <string>http://gluonhq.com/</string>
    <key>SEARCH_PATTERN</key>
    <string>The latest version .*? is &lt;strong&gt;(?P&lt;version&gt;[0-9.]+)&lt;.*?Mac OS.*?dl=(?P&lt;dlpath&gt;/.*?)"</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <!-- Download process: the link on the page is
       https://gluonhq.com/products/scene-builder/thanks/?dl=/download/scene-builder-VER-mac/
       which uses JavaScript to redirect the client to a URL which is
       https://gluonhq.com plus whatever was in the dl parameter. This is then
       a redirect to the real location.  Because it's a redirect, we have to
       tell curl what name to save the file as.
   -->
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
        <key>re_flags</key>
        <array>
          <string>DOTALL</string>
        </array>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%%dlpath%</string>
        <key>filename</key>
        <string>%NAME%-%version%.pkg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
