<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2016</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Gluon Scene Builder</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.SceneBuilder</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SceneBuilder</string>
    <key>BASE_URL</key>
    <string>http://gluonhq.com/labs/scene-builder/</string>
    <key>DOWNLOAD_URL</key>
    <string>http://download.gluonhq.com/scenebuilder/</string>
    <key>SEARCH_PATTERN</key>
    <string>The latest version .* is &lt;strong&gt;(?P&lt;version&gt;[0-9.]+)&lt;</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <!-- Download process: the link on the page is
       http://gluonhq.com/download/scene-builder-mac/
       which redirects the client to
       http://download.gluonhq.com/scenebuilder/8.2.0/install/mac/SceneBuilder-8.2.0.dmg
       but their server doesn't seem to redirect if the client is curl, so
       instead find out the version number and go directly to the known URL.
       Obviously this will break if they ever change it. -->
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%%version%/install/mac/SceneBuilder-%version%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
