<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2022</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Gluon Scene Builder</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.SceneBuilder</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SceneBuilder</string>
    <key>ARCH</key><!-- x86_64 or arm64 -->
    <string>arm64</string>
    <key>ARCHTEXT</key><!-- Intel or Apple Silicon -->
    <string>Apple Silicon</string>
    <key>BASE_URL</key>
    <string>https://gluonhq.com/products/scene-builder/</string>
    <key>SEARCH_PATTERN</key>
    <string>Scene Builder &lt;strong&gt;(?P&lt;version&gt;[0-9.]+)&lt;.*?Mac OS.*?%ARCHTEXT%.*?dl=(?P&lt;dlpath&gt;.*?)"</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%BASE_URL%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
        <key>re_flags</key>
        <array>
          <string>DOTALL</string>
        </array>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%dlpath%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
