<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2016</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Imports the current version of Protégé into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.Protege</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Protege</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME%</string>
    <key>DISPLAY_NAME</key>
    <string>Protégé</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>minimum_os_version</key>
      <string>10.11.0</string>
      <key>developer</key>
      <string>Stanford Center for Biomedical Informatics Research</string>
      <key>display_name</key>
      <string>%DISPLAY_NAME%</string>
      <key>category</key>
      <string>Software Development</string>
      <key>description</key>
      <string>Protégé is a free open-source platform providing a suite of tools to construct domain models and knowledge-based applications with ontologies.</string>
    </dict>
  </dict>
  <key>ParentRecipe</key>
  <string>uk.ac.ox.orchard.pkg.Protege</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pkg_path%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
