<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2016</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Gary Ballantine</string>
      <key>Email</key>
      <string>gary.ballantine at it.ox.ac.uk</string>
      <key>Github</key>
      <string>AltMeta</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Grabs the newest Matlab ISO from AFS</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Matlab</string>
  <key>Input</key>
  <dict>
  	<key>Name</key>
	<string>MatLab</string>
	<key>PATH</key>
	<string>/afs/path</string>
	<key>SEARCH_PATTERN</key>
	<string>Mac</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.2</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AFSFileSearcher</string>
      <key>Arguments</key>
      <dict>
      	<key>path</key>
	<string>%PATH%</string>
	<key>re_pattern</key>
	<string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
  </array>
</dict> 
</plist>
