<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2015</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Gary Ballantine</string>
        <key>Email</key>
        <string>gary.ballantine at it.ox.ac.uk</string>
        <key>Github</key>
        <string>AltMeta</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Download the current version of AuriStor and package it</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.AuriStor</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>AuriStor</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.AuriStor</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    <dict>
      <key>Processor</key>
      <string>PkgCopier</string>
      <key>Arguments</key>
      <dict>
        <key>source_pkg</key>
	<string>%pathname%/*.pkg</string>
	<key>pkg_path</key>
	<string>%RECIPE_CACHE_DIR%/downloads/%NAME%%rel%-%ver%.pkg</string>
      </dict>
    </dict>
    </array>
</dict>
</plist>
