<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2018</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of Google Cloud SDK and imports it into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.Google_Cloud_SDK</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Google_Cloud_SDK</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME%</string>
    <key>DISPLAY_NAME</key>
    <string>Google Cloud SDK</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>developer</key>
      <string>Google</string>
      <key>display_name</key>
      <string>%DISPLAY_NAME%</string>
      <key>category</key>
      <string>Utilities</string>
      <key>description</key>
      <string>The Cloud SDK is a set of tools for Google's Cloud Platform.  You can run these tools interactively or in your automated scripts.</string>
    </dict>
  </dict>
  <key>ParentRecipe</key>
  <string>uk.ac.ox.orchard.pkg.Google_Cloud_SDK</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
          <key>postinstall_script</key>
          <string>#!/bin/sh
 cd /usr/local/bin; for f in bq docker-credential-gcloud gcloud git-credential-gcloud.sh gsutil; do ln -sf "../google-cloud-sdk/bin/$f" .; done
          </string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pkg_path%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
