<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Attribution</key>
		<dict>
			<key>Copyright</key>
			<string>University of Oxford 2016</string>
			<key>Author</key>
			<dict>
				<key>Name</key>
				<string>Christopher Beard</string>
				<key>Email</key>
				<string>christopher.beard at it.ox.ac.uk</string>
				<key>Github</key>
				<string>cdbeard</string>
			</dict>
		</dict>
		<key>Description</key>
		<string>Downloads latest version of StatPlus:mac LE and creates a pkg</string>
		<key>Identifier</key>
		<string>uk.ac.ox.orchard.pkg.StatPlus_mac_LE</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>StatPlus_mac_LE</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>uk.ac.ox.orchard.download.StatPlus_mac_LE</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>app_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/*.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
