<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2016</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ian Collier</string>
      <key>Email</key>
      <string>ian.collier at cs.ox.ac.uk</string>
      <key>Github</key>
      <string>imc0</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the current release version of FDR, packages it, and imports into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.FDR</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>FDR</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME%</string>
    <key>DISPLAY_NAME</key>
    <string>FDR - the CSP Refinement Checker</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
      <key>minimum_os_version</key>
      <string>10.11.0</string>
      <key>developer</key>
      <string>University of Oxford</string>
      <key>display_name</key>
      <string>%DISPLAY_NAME%</string>
      <key>category</key>
      <string>Software Development</string>
      <key>description</key>
      <string>FDR analyses programs written in CSP_M, which combines the operators of Hoare's CSP with a functional programming language. It also has support for analysing timed systems, via tock CSP.</string>
    </dict>
  </dict>
  <key>ParentRecipe</key>
  <string>uk.ac.ox.orchard.pkg.FDR</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
        </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pkg_path%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>

