<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Downloads the latest version of Blackmagic HyperDeck and imports it into munki</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.HyperDeck</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>category</key>
        <string>Design and Media</string>
        <key>description</key>
        <string>??</string>
        <key>developer</key>
        <string>Blackmagic Design</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.HyperDeck</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>purge_destination</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/Blackmagic_HyperDeck_%version%.dmg/Install HyperDeck v%version%.pkg</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
