<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2019</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Stefan Lutener</string>
      <key>Email</key>
      <string>stefan.lutener at it.ox.ac.uk</string>
      <key>Github</key>
      <string>stefanj135</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of Reflector Teacher.</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.ReflectorTeacher</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Reflector Teacher</string>
    <key>SPARKLE_FEED_URL</key>
    <string>https://updates.airsquirrels.com/ReflectorTeacher/Mac/ReflectorTeacher.xml</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.5.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>appcast_url</key>
        <string>%SPARKLE_FEED_URL%</string>
      </dict>
      <key>Processor</key>
      <string>SparkleUpdateInfoProvider</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%-%version%.dmg</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
