<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2019</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Stefan Lutener</string>
      <key>Email</key>
      <string>stefan.lutener at it.ox.ac.uk</string>
      <key>Github</key>
      <string>stefanj135</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of Reflector Teacher and imports it into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.RelectorTeacher</string>
  <key>Input</key>
  <dict>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>%NAME$</string>
    <key>NAME</key>
    <string>Reflector_Teacher</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>unstable</string>
      </array>
      <key>category</key>
      <string>Office and Productivity</string>
      <key>description</key>
      <string>Reflector Teacher is a wireless mirroring and streaming reciever that works with Google Cast and AirPlay-enabled devices.
Everything you do on your phone, tablet or computer can be wirelessly sent to reflector.</string>
      <key>display name</key>
      <string>Reflector Teacher</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>uk.ac.ox.orchard.download.ReflectorTeacher</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>  




