<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2017</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Stefan Lutener</string>
        <key>Email</key>
        <string>stefan.lutener at it.ox.ac.uk</string>
        <key>Github</key>
        <string>stefanj135</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Downloads the latest version of Shotcut</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.Shotcut</string>
    <key>Input</key>
    <dict>
      <key>GITHUB_REPO</key>
      <string>mltframework/shotcut</string>
      <key>NAME</key>
      <string>Shotcut</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>github_repo</key>
          <string>%GITHUB_REPO%</string>
          <key>asset_regex</key>
          <string>([a-z0-9-._]*.dmg)</string>
        </dict>
        <key>Processor</key>
        <string>GitHubReleasesInfoProvider</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>filename</key>
          <string>%NAME%-%version%.dmg</string>
        </dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
