<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Ben Goodstein</string>
        <key>Email</key>
        <string>ben.goodstein at it.ox.ac.uk</string>
        <key>Github</key>
        <string>fuzzylogiq</string>
      </dict>
    </dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.AdobeCreativeCloudInstaller</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>Adobe_CC</string>
      <key>NAME</key>
      <string>Creative Cloud Installer</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>category</key>
        <string>Creative Cloud</string>
        <key>description</key>
        <string>This updates the Creative Cloud app that runs in your taskbar if you have Adobe Creative Cloud apps installed.</string>
        <key>developer</key>
        <string>Adobe</string>
        <key>display_name</key>
        <string>Creative Cloud Installer</string>
        <key>name</key>
        <string>Creative_Cloud_Installer</string>
        <key>unattended_install</key>
        <true/>
        <key>uninstall_method</key>
        <string>uninstall_script</string>
        <key>uninstall_script</key>
      <string>#!/bin/bash
sudo "/Applications/Utilities/Adobe Creative Cloud/Utils/Creative Cloud Uninstaller.app/Contents/MacOS/Creative Cloud Uninstaller" -u
</string>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>installs_item_paths</key>
          <array>
            <string>/Applications/Utilities/Adobe Creative Cloud/ACC/Creative Cloud.app</string>
          </array>
          <key>version_comparison_key</key>
          <string>CFBundleShortVersionString</string>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict/>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
