<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ben Goodstein</string>
      <key>Email</key>
      <string>ben.goodstein at it.ox.ac.uk</string>
      <key>Github</key>
      <string>fuzzylogiq</string>
    </dict>
  </dict>
	<key>Description</key>
	<string>Downloads the latest version of EditReady and imports it into Munki.</string>
	<key>Identifier</key>
	<string>uk.ac.ox.orchard.munki.EditReady</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>EditReady</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>unstable</string>
			</array>
			<key>description</key>
			<string>Simple and fast transcode for various media formats.</string>
			<key>developer</key>
			<string>Divergent Media</string>
			<key>display_name</key>
			<string>EditReady</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>uk.ac.ox.orchard.download.EditReady</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/EditReady.app</string>
				<key>dmg_megabytes</key>
				<string>100</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
