<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2022</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>James Robson</string>
        <key>Email</key>
        <string>james.robson at it.ox.ac.uk</string>
        <key>Github</key>
        <string>lordshellby</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Downloads the latest version of MeshLab.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.MeshLab</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>MeshLab</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Design and Media</string>
        <key>description</key>
        <string>MeshLab is an open source, portable, and extensible system for the processing and editing of unstructured large 3D triangular meshes.</string>
        <key>developer</key>
        <string>Visual Computing Laboratory</string>
        <key>display_name</key>
        <string>%NAME%</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.MeshLab</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
