<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Apache ant binaries</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.apache-ant</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Apache_Ant</string>
      <key>USER_AGENT</key>
      <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_6) AppleWebKit/603.2.5 (KHTML, like Gecko) Version/10.1.1 Safari/603.2.5</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>http://ant.apache.org/bindownload.cgi</string>
          <key>request_headers</key>
          <dict>
              <key>user-agent</key>
              <string>%USER_AGENT%</string>
          </dict>
          <key>re_pattern</key>
          <string>(?P&lt;url&gt;http.+?apache-ant-(?P&lt;version&gt;.+?)-bin.tar.gz)</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <!-- Due to the use of mirrors, the ETag and Modified Dates cannot be used -->
          <key>CHECK_FILESIZE_ONLY</key>
          <true/>
          <key>url</key>
          <string>%url%</string>
          <key>filename</key>
          <string>%NAME%-%version%.tar.gz</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict> 
</plist>
