<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Apache maven binaries</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.download.apache-maven</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Apache_Maven</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>http://maven.apache.org/download.cgi</string>
          <key>re_pattern</key>
          <string>(?P&lt;url&gt;http.+?apache-maven-(?P&lt;version&gt;.+?)-bin.tar.gz)</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%url%</string>
          <key>filename</key>
          <string>%NAME%-%version%.tar.gz</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict> 
</plist>
