<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Packages a the latest version of Apache Ant</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.pkg.apache-maven</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Apache_Ant</string>
    </dict>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.apache-maven</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/payload</string>
          <key>pkgdirs</key>
          <dict>
            <key>opt</key>
            <string>0775</string>
            <key>opt/apache_maven</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%RECIPE_CACHE_DIR%/unpack/*/</string>
          <key>destination_path</key>
          <string>%pkgroot%/opt/apache_maven/</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkgtype</key>
            <string>flat</string>
            <key>scripts</key>
            <string>Maven_Scripts</string>
            <key>id</key>
            <string>uk.ac.ox.orchard.pkg.apache-maven</string>
            <key>version</key>
            <string>%version%</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>opt</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
              <dict>
                <key>path</key>
                <string>opt/apache_maven</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict> 
</plist>
