<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>  
  <string>Imports latest version of Inkscape into Munki</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.munki.Inkscape</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Inkscape</string>
    <key>MUNKI_CATEGORY</key>
    <string>Design and Media</string>
    <key>MUNKI_DESCRIPTION</key>
    <string>Inkscape is an Open Source vector graphics editor, with capabilities similar to Illustrator, CorelDraw, or Xara X, using the W3C standard Scalable Vector Graphics (SVG) file format.</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>category</key>
      <string>%MUNKI_CATEGORY%</string>
      <key>description</key>
      <string>%MUNKI_DESCRIPTION%</string>
      <key>display_name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.2</string>
  <key>ParentRecipe</key>
  <string>com.github.hansen-m.download.Inkscape</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
