<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2017</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Christopher Beard</string>
        <key>Email</key>
        <string>christopher.beard@it.ox.ac.uk</string>
        <key>Github</key>
        <string>cdbeard</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Packages contents of 'Payload' dir and imports into munki.</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.EndNote_CrossRef_Connection</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>EndNote_CrossRef_Connection</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>unstable</string>
        </array>
        <key>category</key>
        <string>Office and Productivity</string>
        <key>description</key>
        <string>Updated CrossRef connection file for EndNoteX5+ enforcing secure connection.</string>
        <key>developer</key>
        <string>Oxford University</string>
        <key>display_name</key>
        <string>EndNote CrossRef Connection</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.pkg.EndNote_CrossRef_Connection</string>
    <key>Process</key>
    <array>
      <!-- Import to munki repo -->
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pkg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
    <key>update_for</key>
    <array>
      <string>EndNoteX8</string>
    </array>
  </dict>
</plist>
