<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>Description</key>
      <string>Downloads the current version of VirtualBox and imports into munki.</string>
      <key>Identifier</key>
      <string>uk.ac.ox.orchard.munki.virtualbox</string>
      <key>Input</key>
      <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>VirtualBox</string>
            <key>NAME</key>
            <string>VirtualBox</string>
            <key>pkginfo</key>
            <dict>
                  <key>catalogs</key>
                  <array>
                        <string>testing</string>
                  </array>
                  <key>category</key>
                  <string>Utilities</string>
                  <key>description</key>
                  <string>VirtualBox is a general-purpose full virtualizer for x86 hardware, targeted at server, desktop and embedded use.</string>
                  <key>display_name</key>
                  <string>VirtualBox</string>
                  <key>name</key>
                  <string>%NAME%</string>
                  <key>unattended_install</key>
                  <true/>
            </dict>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.sheagcraig.pkg.VirtualBox</string>
      <key>Process</key>
      <array>
      <dict>
            <key>Arguments</key>
            <dict>
                  <key>pkg_path</key>
                  <string>%pkg_path%</string>
                  <key>repo_subdirectory</key>
                  <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
      </dict>
      </array>
</dict>
</plist>
