<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Attribution</key>
    <dict>
      <key>Copyright</key>
      <string>University of Oxford 2016</string>
      <key>Author</key>
      <dict>
        <key>Name</key>
        <string>Stefan Lutener</string>
        <key>Email</key>
        <string>stefan.lutener at it.ox.ac.uk</string>
        <key>Github</key>
        <string>stefanj135</string>
      </dict>
    </dict>
    <key>Description</key>
    <string>Downloads the current version of Mono and imports into munki</string>
    <key>Identifier</key>
    <string>uk.ac.ox.orchard.munki.Mono</string>
    <key>Input</key>
    <dict>
      <!--Please choose between Visual or Stable
      We recommend the Visual Studio channel if you're using Visual Studio for Mac
      since the stability of Visual Studio for Mac is only guaranteed
      with the Visual Studio channel releases.-->
      <key>CHANNEL</key>
      <string>Visual</string>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>%NAME%</string>
      <key>NAME</key>
      <string>Mono</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Software Development</string>
        <key>description</key>
        <string>Mono is an open source implementation of Microsoft's .NET Framework based on the ECMA standards for C# and the Common Language Runtime. A growing family of solutions and an active and enthusiastic contributing community is helping position Mono to become the leading choice for development of cross platform applications.</string>
        <key>display_name</key>
        <string>Mono</string>
        <key>developer</key>
        <string>Mono Project</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>uk.ac.ox.orchard.download.Mono</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>Versioner</string>
          <key>Arguments</key>
          <dict>
            <key>input_plist_path</key>
            <string>%RECIPE_CACHE_DIR%/downloads/monoframework-mdk-*.macos10.xamarin.universal.pkg/mono.pkg/Scripts/version.plist</string>
            <key>plist_version_key</key>
            <string>CFBundleShortVersionString</string>
          </dict>
	<key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>version_comparison_key</key>
          <string>CFBundleShortVersionString</string>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
