<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Attribution</key>
  <dict>
    <key>Copyright</key>
    <string>University of Oxford 2015</string>
    <key>Author</key>
    <dict>
      <key>Name</key>
      <string>Ben Goodstein</string>
      <key>Email</key>
      <string>ben.goodstein at it.ox.ac.uk</string>
      <key>Github</key>
      <string>fuzzylogiq</string>
    </dict>
  </dict>
  <key>Description</key>
  <string>Downloads the latest version of Uebersicht</string>
  <key>Identifier</key>
  <string>uk.ac.ox.orchard.download.Uebersicht</string>
  <key>Input</key>
  <dict>
    <key>DOWNLOAD_URL</key>
    <string>https://tracesof.net/uebersicht/</string>
    <key>DOWNLOAD_REGEX</key>
    <string>(?P&lt;url&gt;https://tracesof.net/uebersicht/releases/Uebersicht-(?P&lt;version&gt;.*).app.zip)</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
        <key>re_pattern</key>
        <string>%DOWNLOAD_REGEX%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>
